Revit 2027 API
ReferenceArrayArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ReferenceArrayArrayIterator ForwardIterator()
Public Overridable Function ForwardIterator As ReferenceArrayArrayIterator
public:
virtual ReferenceArrayArrayIterator^ ForwardIterator()
abstract ForwardIterator : unit -> ReferenceArrayArrayIterator
override ForwardIterator : unit -> ReferenceArrayArrayIterator
Return Value
ReferenceArrayArrayIterator
Returns a forward moving iterator to the array.
See Also
Reference
ReferenceArrayArray Class
Autodesk.Revit.DB Namespace